//-----------------------------------------------------------------------------
// File : Config.h
// Desc : Configuration.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <asdxEditParam.h>


///////////////////////////////////////////////////////////////////////////////
// PanelSetting structure
///////////////////////////////////////////////////////////////////////////////
struct PanelSetting
{
    bool            Open    = true;
    asdx::Vector2   Pos     = asdx::Vector2(0.0f, 0.0f);
    asdx::Vector2   Size    = asdx::Vector2(0.0f, 0.0f);

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    PanelSetting()
    { /* DO_NOTHING */ }

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //-------------------------------------------------------------------------
    PanelSetting(bool open, float x, float y, float w, float h)
    : Open(open)
    , Pos (x, y)
    , Size(w, h)
    { /* DO_NOTHING */ }

    //-------------------------------------------------------------------------
    //! @brief      シリアライズします.
    //-------------------------------------------------------------------------
    tinyxml2::XMLElement* Serialize(tinyxml2::XMLDocument* doc, const char* tag);

    //-------------------------------------------------------------------------
    //! @brief      デシリアライズします.
    //-------------------------------------------------------------------------
    void Deserialize(tinyxml2::XMLElement* element, const char* tag);
};

///////////////////////////////////////////////////////////////////////////////
// BackgroundSetting structure
///////////////////////////////////////////////////////////////////////////////
struct BackgroundSetting
{
    asdx::EditColor3 ClearColor;
    asdx::EditBool   ShowTexture;

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    BackgroundSetting();

    //-------------------------------------------------------------------------
    //! @brief      シリアライズします.
    //-------------------------------------------------------------------------
    tinyxml2::XMLElement* Serialize(tinyxml2::XMLDocument* doc);

    //-------------------------------------------------------------------------
    //! @brief      デシリアライズします.
    //-------------------------------------------------------------------------
    void Deserialize(tinyxml2::XMLElement* element);

    //-------------------------------------------------------------------------
    //! @brief      編集処理を行います.
    //-------------------------------------------------------------------------
    void Edit();
};


///////////////////////////////////////////////////////////////////////////////
// CameraSetting structure
///////////////////////////////////////////////////////////////////////////////
struct CameraSetting
{
    asdx::EditInt   Type;
    asdx::EditFloat FieldOfView;
    asdx::EditFloat NearClip;
    asdx::EditFloat FarClip;
    asdx::EditFloat RotateGain;
    asdx::EditFloat DollyGain;
    asdx::EditFloat MoveGain;
    asdx::EditFloat WheelGain;

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    CameraSetting();

    //-------------------------------------------------------------------------
    //! @brief      シリアライズします.
    //-------------------------------------------------------------------------
    tinyxml2::XMLElement* Serialize(tinyxml2::XMLDocument* doc);

    //-------------------------------------------------------------------------
    //! @brief      デシリアライズします.
    //-------------------------------------------------------------------------
    void Deserialize(tinyxml2::XMLElement* element);

    //-------------------------------------------------------------------------
    //! @brief      編集処理を行います.
    //-------------------------------------------------------------------------
    void Edit();
};


///////////////////////////////////////////////////////////////////////////////
// DebugSetting structure
///////////////////////////////////////////////////////////////////////////////
struct DebugSetting
{
    asdx::EditBool  DrawBone;
    asdx::EditBool  DrawLightDir;
    asdx::EditBool  DrawGrid;
    asdx::EditBool  DrawAxis;

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    DebugSetting();

    //-------------------------------------------------------------------------
    //! @brief      シリアライズします.
    //-------------------------------------------------------------------------
    tinyxml2::XMLElement* Serialize(tinyxml2::XMLDocument* doc);

    //-------------------------------------------------------------------------
    //! @brief      デシリアライズします.
    //-------------------------------------------------------------------------
    void Deserialize(tinyxml2::XMLElement* element);

    //-------------------------------------------------------------------------
    //! @brief      編集します.
    //-------------------------------------------------------------------------
    void Edit();
};


///////////////////////////////////////////////////////////////////////////////
// Config struct
///////////////////////////////////////////////////////////////////////////////
struct Config
{
    int             MainWindowWidth     = 1920;
    int             MainWindowHeight    = 1080;
    bool            ShowFPS             = true;
    PanelSetting    PanelEdit           = PanelSetting(true,  1510,  10, 400, 1060);
    PanelSetting    PanelMesh           = PanelSetting(false, 1510, 520, 400, 400);
//    PanelSetting    PanelBoneTree   = PanelSetting(false, 10, 80, 400, 300);
//    PanelSetting    PanelBoneDetail = PanelSetting(false, 10, 390, 400, 320);

    BackgroundSetting   Background;
    CameraSetting       Camera;
    DebugSetting        Debug;

    bool Load(const char* path);
    bool Save(const char* path);
};
